       FD  SAM-FILE
           RECORD NAME SAM-FILE-RECORD
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 96 CHARACTERS.
       01  SAM-FILE-RECORD.
           05 SAM-FILE-KEY-NUMBER 	PIC X(6).
           05 SAM-FILE-NAME    		PIC X(30).
           05 SAM-FILE-ADDRESS   	PIC X(30).
           05 SAM-FILE-CONTACT 		PIC X(30). 